spec/fixtures/stripe_webhooks/evt_customer_subscription_updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_123",
  "type": "customer.subscription.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2014-11-05",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "plan": {
        "interval": "month",
        "name": "Test",
        "created": 1425123302,
        "amount": 2499,
        "currency": "eur",
        "id": "TEST_00000000000000",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {
        },
        "statement_descriptor": null,
        "statement_description": null
      },
      "object": "subscription",
      "start": 1425815845,
      "status": "active",
      "customer": "cus_00000000000000",
      "cancel_at_period_end": false,
      "current_period_start": 1425815845,
      "current_period_end": 1428494245,
      "ended_at": null,
      "trial_start": null,
      "trial_end": null,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null,
      "discount": null,
      "tax_percent": null,
      "metadata": {
      }
    },
    "previous_attributes": {
      "plan": {
        "interval": "month",
        "name": "Old plan",
        "created": 1425123302,
        "amount": 2499,
        "currency": "eur",
        "id": "OLD_PLAN_ID",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {
        },
        "statement_descriptor": null,
        "statement_description": null
      }
    }
  }
}