spec/fixtures/stripe_webhooks/evt_invoice_payment_failed.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_123455frtg",
  "type": "invoice.payment_failed",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2014-11-05",
  "data": {
    "object": {
      "date": 1425245198,
      "id": "in_00000000000000",
      "period_start": 1425245192,
      "period_end": 1425245198,
      "lines": {
        "data": [
          {
            "id": "sub_5pi7gqgiqSZKpV",
            "object": "line_item",
            "type": "subscription",
            "livemode": true,
            "amount": 2499,
            "currency": "eur",
            "proration": false,
            "period": {
              "start": 1428492962,
              "end": 1431084962
            },
            "subscription": null,
            "quantity": 1,
            "plan": {
              "interval": "month",
              "name": "Test",
              "created": 1425123302,
              "amount": 2499,
              "currency": "eur",
              "id": "TEST",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {
              },
              "statement_descriptor": null,
              "statement_description": null
            },
            "description": null,
            "metadata": {
            }
          }
        ],
        "total_count": 1,
        "object": "list",
        "url": "/v1/invoices/in_15beaAAQkfalJzyKLe9aQYr0/lines"
      },
      "subtotal": 122,
      "total": 122,
      "customer": "cus_00000000000000",
      "object": "invoice",
      "attempted": true,
      "closed": false,
      "forgiven": false,
      "paid": false,
      "livemode": false,
      "attempt_count": 1,
      "amount_due": 122,
      "currency": "eur",
      "starting_balance": 0,
      "ending_balance": 0,
      "next_payment_attempt": null,
      "webhooks_delivered_at": 1425245208,
      "charge": "ch_00000000000000",
      "discount": null,
      "application_fee": null,
      "subscription": null,
      "tax_percent": null,
      "tax": null,
      "metadata": {
      },
      "statement_descriptor": null,
      "description": null,
      "receipt_number": null,
      "statement_description": null
    }
  }
}